a = {'король', 'шут', 'танец', 'гений', 'стук', 'перемены', 'утро'}
q = ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю']
b = a.pop()
n = b
c = (len(b) * ' _ ').split()
x = ''
d = []
print(c)
while x != n:
    print('Введите букву или слово.')
    m = input()
    d.append(m)
    if m in q and m in b:
        if m in n:
            print('Молодец! Ты угадал(а) букву!')
            for i in range(b.count(m)):
                c[b.find(m)] = m
                b = b.replace(m, '*', 1)
            print(c)
            x = ''.join(c)
    elif m == n:
        break
    elif m in q and m not in b:
        if m in d:
            print('Эту букву уже вводили.')
        else:
            print('Этой буквы нет в слове.')
    else:
        print('Нужно ввести одну букву или угадываемое слово.')
print('Поздравляю!!! Ты отгадал(а) слово!')
print('Это было слово', n + '.')
